Revit 2027 API
BuiltInFailures.RebarFailures.RebarInvalidRunnout Property
 The remainder is less than one bar diameter, which may result in double counting in schedules. Adjust the layout or remove one of the overlapped bars.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId RebarInvalidRunnout { get; }
Public Shared ReadOnly Property RebarInvalidRunnout As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ RebarInvalidRunnout {
	FailureDefinitionId^ get ();
}
static member RebarInvalidRunnout : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.RebarFailures Class
Autodesk.Revit.DB Namespace